/******************************************************
文件名：	PrvtProt.h

描述：	企业私有协议（浙江合众）	

Data			  Vasion			author
2019/04/16		   V1.0			    liujian
*******************************************************/
#ifndef		_PRVTPROT_H
#define		_PRVTPROT_H
/*******************************************************
description： include the header file
*******************************************************/
//#include "PrvtProt.h"

/*******************************************************
description： macro definitions
*******************************************************/
/**********宏开关定义*********/

/**********宏常量定义*********/



/***********宏函数***********/

/*******************************************************
description： struct definitions
*******************************************************/

/*******************************************************
description： typedef definitions
*******************************************************/
/*****struct definitions*****/
typedef struct 
{		
	unsigned char NewFlag;/* 发送数据有效标志*/
}PrvtProt_RxMsg; /*报文接收结构体*/ 


typedef struct 
{		
	unsigned char NewFlag;/* 发送数据有效标志*/
	unsigned char Lng;/* 发送数据长度*/
	unsigned char Dt[20U];/* 发送数据缓冲区*/
}PrvtProt_TxMsg; /*报文发送结构体*/
/******enum definitions******/

/******union definitions*****/

/*******************************************************
description： variable External declaration
*******************************************************/

/*******************************************************
description： function External declaration
*******************************************************/


#endif 
